#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Шамиль. Не забудьте о том, что автор должен быть упомянут на отдельной строке.

# Mogucheva K.S.
# 01.09.2016

print ("Боишься — не говори, сказал — не бойся…")
print ("\t\t\t\t\t\tИ.Шамиль")

print("\a")
input("Haжмитe Enter. чтобы выйти.")