# Задача 1. Вариант 16.
# Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Грета Густафсон. После вывода информации программа должна дожидаться пока пользователь нажмет Enter для выхода.

# Mogucheva K.S.
# 01.09.2016

print("Грета Густафсон известена, как шведская и американская актриса Грета Гарбо")

input("\n\nНажмите Enter для выхода.")